## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "2239424651" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
              ~ (known after apply),
                # (3 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      ~ id       = "36c1ac7bfaae2098aeecca606ab6e88d8f161b118d0d5fea0b53d0c8dbad6b7f" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts"         = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                        = {
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - CapacityProviderStrategy = [
                                          - {
                                              - Base             = 1
                                              - CapacityProvider = "FARGATE_SPOT"
                                              - Weight           = 5
                                            },
                                          - {
                                              - Base             = 0
                                              - CapacityProvider = "FARGATE"
                                              - Weight           = 1
                                            },
                                        ]
                                      - Cluster                  = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - NetworkConfiguration     = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides                = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition           = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - ErrorEquals     = [
                                              - "States.TaskFailed",
                                            ]
                                          - IntervalSeconds = 120
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Neo4J Sentinel Forwarder"
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - "Neo4J Sentinel Forwarder" = {
                      - End        = true
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - SecurityGroups = [
                                      - "sg-03caf974f268a3efb",
                                    ]
                                  - Subnets        = [
                                      - "subnet-08cab5daf34489c53",
                                      - "subnet-07f8e17bbf11b0797",
                                      - "subnet-0d92713028fd15243",
                                    ]
                                }
                            }
                          - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.sync"
                      - Type       = "Task"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
      ~ vars     = {
          ~ "CARTOGRAPHY_TASK_DEF"              = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5" -> (known after apply)
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.cartography must be replaced
-/+ resource "aws_ecs_task_definition" "cartography" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "cartography"
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "cartography" -> (known after apply)
      ~ memory                   = "16384" -> "8192" # forces replacement
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be updated in-place
  ~ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
        id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECS"
        name      = "CartographyStateMachineECS"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.asset_inventory_cartography will be updated in-place
  ~ resource "aws_sfn_state_machine" "asset_inventory_cartography" {
      ~ definition    = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts"         = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                        = {
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - CapacityProviderStrategy = [
                                          - {
                                              - Base             = 1
                                              - CapacityProvider = "FARGATE_SPOT"
                                              - Weight           = 5
                                            },
                                          - {
                                              - Base             = 0
                                              - CapacityProvider = "FARGATE"
                                              - Weight           = 1
                                            },
                                        ]
                                      - Cluster                  = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - NetworkConfiguration     = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides                = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition           = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - ErrorEquals     = [
                                              - "States.TaskFailed",
                                            ]
                                          - IntervalSeconds = 120
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Neo4J Sentinel Forwarder"
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - "Neo4J Sentinel Forwarder" = {
                      - End        = true
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - SecurityGroups = [
                                      - "sg-03caf974f268a3efb",
                                    ]
                                  - Subnets        = [
                                      - "subnet-08cab5daf34489c53",
                                      - "subnet-07f8e17bbf11b0797",
                                      - "subnet-0d92713028fd15243",
                                    ]
                                }
                            }
                          - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.sync"
                      - Type       = "Task"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
        id            = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
        name          = "asset-inventory-cartography"
        tags          = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
